various/230428_compare_server_performance/rust_actix/test_230514_compare_actix_go_fiber_flask.txt

Test autocannon with Rust Actix

autocannon -c 100 -d 5 -p 10 http://127.0.0.1:5000


================================================================================

Running 5s test @ http://127.0.0.1:5000
100 connections with 10 pipelining factor

┌─────────┬───────┬───────┬───────┬───────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼──────────┼────────┤
│ Latency │ 15 ms │ 31 ms │ 60 ms │ 74 ms │ 31.49 ms │ 13.45 ms │ 179 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 26399   │ 26399   │ 32927   │ 34143   │ 31568   │ 2733.42 │ 26388   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 2.46 MB │ 2.46 MB │ 3.06 MB │ 3.17 MB │ 2.94 MB │ 254 kB  │ 2.45 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 5

159k requests in 5.1s, 14.7 MB read


================================================================================

let's compare latency median:
- go fiber          28ms
- go net/http       22ms
- flask gunicorn  2466ms
- rust actix        31ms

let's compare req/s median:
- go fiber        35007
- go net/http     43039
- flask gunicorn   2091
- rust actix      32927


let's compare throughput (bytes/s) median:
- go fiber        4130 kB
- go net/http     5170 kB
- flask gunicorn   341 kB
- rust actix      3060 kB

Interestingly Rust Actix had a worst performance compared to go fiber

================================================================================